#### `terraform plan` Success

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
+ create
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.automation.aws_cloudwatch_event_target.sns[0] will be created
+ resource "aws_cloudwatch_event_target" "sns" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "run_daily"
      + target_id = (known after apply)
    }

  # module.automation.aws_cloudwatch_event_target.sns[1] will be created
+ resource "aws_cloudwatch_event_target" "sns" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "run_daily"
      + target_id = (known after apply)
    }

  # module.automation.aws_cloudwatch_event_target.sns[2] will be created
+ resource "aws_cloudwatch_event_target" "sns" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + rule      = "run_daily"
      + target_id = (known after apply)
    }

  # module.automation.aws_cloudwatch_log_group.this[0] will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/clean_amis-tf2-competitive"
      + retention_in_days = 60
    }

  # module.automation.aws_cloudwatch_log_group.this[1] will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/clean_amis-grafana"
      + retention_in_days = 60
    }

  # module.automation.aws_cloudwatch_log_group.this[2] will be created
+ resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/clean_amis-base"
      + retention_in_days = 60
    }

  # module.automation.aws_iam_role.clean_amis will be created
+ resource "aws_iam_role" "clean_amis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "lambda_clean_amis"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.automation.aws_iam_role_policy.allow_cloudwatch_logs will be created
+ resource "aws_iam_role_policy" "allow_cloudwatch_logs" {
      + id     = (known after apply)
      + name   = "allow_logs"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.automation.aws_iam_role_policy.allow_image_delete will be created
+ resource "aws_iam_role_policy" "allow_image_delete" {
      + id     = (known after apply)
      + name   = "allow_image_delete"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:DescribeImages",
                          + "ec2:DeregisterImage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # module.automation.aws_lambda_function.clean_amis[0] will be created
+ resource "aws_lambda_function" "clean_amis" {
      + arn                            = (known after apply)
      + function_name                  = "clean_amis-tf2-competitive"
      + handler                        = "clean_amis.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "660714711582.lambdas"
      + s3_key                         = "clean_amis.zip"
      + source_code_hash               = "Mv7G6MFJybtIdsrGqC/IYuHC35CwAuio+O+0B0VduBE="
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "family" = "tf2-competitive"
              + "keep"   = "3"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.automation.aws_lambda_function.clean_amis[1] will be created
+ resource "aws_lambda_function" "clean_amis" {
      + arn                            = (known after apply)
      + function_name                  = "clean_amis-grafana"
      + handler                        = "clean_amis.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "660714711582.lambdas"
      + s3_key                         = "clean_amis.zip"
      + source_code_hash               = "Mv7G6MFJybtIdsrGqC/IYuHC35CwAuio+O+0B0VduBE="
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "family" = "grafana"
              + "keep"   = "1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.automation.aws_lambda_function.clean_amis[2] will be created
+ resource "aws_lambda_function" "clean_amis" {
      + arn                            = (known after apply)
      + function_name                  = "clean_amis-base"
      + handler                        = "clean_amis.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.6"
      + s3_bucket                      = "660714711582.lambdas"
      + s3_key                         = "clean_amis.zip"
      + source_code_hash               = "Mv7G6MFJybtIdsrGqC/IYuHC35CwAuio+O+0B0VduBE="
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "family" = "base"
              + "keep"   = "1"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.elasticsearch.aws_elasticsearch_domain.es is tainted, so must be replaced
-/+ resource "aws_elasticsearch_domain" "es" {
      ~ access_policies       = jsonencode( # whitespace changes
            {
                Statement = [
                    {
                        Action    = "es:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "*"
                        }
                        Resource  = "arn:aws:es:us-east-2:660714711582:domain/elasticsearch/*"
                    },
                ]
                Version   = "2012-10-17"
            }
        )
      ~ advanced_options      = {
          - "rest.action.multi.allow_explicit_index" = "true"
        } -> (known after apply)
      ~ arn                   = "arn:aws:es:us-east-2:660714711582:domain/elasticsearch" -> (known after apply)
      ~ domain_id             = "660714711582/elasticsearch" -> (known after apply)
        domain_name           = "elasticsearch"
        elasticsearch_version = "7.1"
      + endpoint              = (known after apply)
      ~ id                    = "arn:aws:es:us-east-2:660714711582:domain/elasticsearch" -> (known after apply)
      ~ kibana_endpoint       = "/_plugin/kibana/" -> (known after apply)
        tags                  = {
            "Domain" = "elasticsearch"
        }

      ~ cluster_config {
          - dedicated_master_count   = 0 -> null
            dedicated_master_enabled = false
            instance_count           = 1
            instance_type            = "t2.small.elasticsearch"
            zone_awareness_enabled   = false
        }

      - cognito_options {
          - enabled = false -> null
        }

      ~ domain_endpoint_options {
          ~ enforce_https       = false -> (known after apply)
          ~ tls_security_policy = "Policy-Min-TLS-1-0-2019-07" -> (known after apply)
        }

      ~ ebs_options {
            ebs_enabled = true
          - iops        = 0 -> null
            volume_size = 10
          ~ volume_type = "gp2" -> (known after apply)
        }

      ~ encrypt_at_rest {
          ~ enabled    = false -> (known after apply)
          + kms_key_id = (known after apply)
        }

      ~ node_to_node_encryption {
          ~ enabled = false -> (known after apply)
        }

      - snapshot_options {
          - automated_snapshot_start_hour = 0 -> null
        }

      ~ vpc_options {
          ~ availability_zones = [
              - "us-east-2a",
            ] -> (known after apply)
            security_group_ids = [
                "sg-05862b89983e48291",
            ]
            subnet_ids         = [
                "subnet-084981cb0e280b1ed",
            ]
          ~ vpc_id             = "vpc-0f18ad265ae712a3c" -> (known after apply)
        }
    }

  # module.elasticsearch.aws_route53_record.internal will be updated in-place
~ resource "aws_route53_record" "internal" {
        fqdn    = "elasticsearch.stf.internal"
        id      = "Z2USQFM1ZI4JD3_elasticsearch_CNAME"
        name    = "elasticsearch"
      ~ records = [
          - "vpc-elasticsearch-c6ksquzxjw4rijhvbie7ksbxgm.us-east-2.es.amazonaws.com",
        ] -> (known after apply)
        ttl     = 300
        type    = "CNAME"
        zone_id = "Z2USQFM1ZI4JD3"
    }

Plan: 13 to add, 1 to change, 1 to destroy.
```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions3`*